blog-backend/app/controllers/comments_controller.rb

  def index
    render json: { comments: Comment.all }, methods: :post_id
---
SELECT "comments".* FROM "comments"

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author", "Caçador de Almas"], ["body", "Cool!"], ["created_at", "2015-11-28 22:38:17.246712"], ["updated_at", "2015-11-28 22:38:17.246712"]]