blog-backend/app/controllers/posts_controller.rb

  def index
    render json: { posts: Post.all, comments: Comment.all }, methods: :comment_ids
---
SELECT "comments".id FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asddasd"], ["body", "aasdasdas"], ["created_at", "2015-11-28 22:21:58.336343"], ["updated_at", "2015-11-28 22:21:58.336343"]]